app/Controllers/Auth.php

    public function validasi()
    {
        // 1. Ambil input form + bersihkan dari spasi gaib
        $username = trim($this->request->getPost('username') ?? '');
        $password = trim($this->request->getPost('password') ?? '');

        if (empty($username) || empty($password)) {
            return redirect()->back()->withInput()->with('error', 'Username dan Password tidak boleh kosong.');
        }

        // 2. Ambil data user dari database
        $db   = \Config\Database::connect();
        $user = $db->table('users')
                   ->where('username', $username)
                   ->get()
                   ->getRowArray();
---
SELECT *
FROM `users`
WHERE `username` = '1212'