app/Controllers/Lembur.php

    public function index()
{
    $session   = session();
    $role      = $session->get('role');
    $unitKerja = $session->get('unit_kerja');
    $idUser    = $session->get('id_user');

    if (!$session->get('isLoggedIn')) {
        return redirect()->to(base_url('auth'))->with('error', 'Silakan login terlebih dahulu.');
    }

    $bulan = $this->request->getGet('bulan') ?? date('m');
    $tahun = $this->request->getGet('tahun') ?? date('Y');
    $filterUser = $this->request->getGet('id_user');

    $db = \Config\Database::connect();
    $data['karyawan_unit'] = [];

    // Reset Model CodeIgniter agar kueri sebelumnya tidak tersangkut di memori
    $this->lemburModel->builder()->resetQuery();

    // =========================================================================
    // LOGIKA FILTER DISERAGAMKAN DAN DIKALIBRASI ANTI-GAIB
    // =========================================================================
    if ($role === 'superadmin' || $role === 'admin') {
        // 1. SUPERADMIN / ADMIN PUSAT: Ambil semua karyawan lintas unit untuk dropdown (Bebas Role)
        $data['karyawan_unit'] = $db->table('users')
                                    ->orderBy('unit_kerja', 'ASC')
                                    ->orderBy('nama_lengkap', 'ASC')
                                    ->get()
                                    ->getResultArray();
---
SELECT *
FROM `users`
ORDER BY `unit_kerja` ASC, `nama_lengkap` ASC

    // Ambil data lembur dan gabungkan secara aman dengan tabel users
    $tableName = $this->lemburModel->table; // Deteksi otomatis nama tabel model (lembur / lemburs)

    $lemburs = $this->lemburModel
                    ->select($tableName . '.*, users.nama_lengkap as nama_pegawai')
                    ->join('users', 'users.id = ' . $tableName . '.id_user', 'left')
                    ->orderBy('tanggal', 'DESC')
                    ->findAll();
---
SELECT `lembur`.*, `users`.`nama_lengkap` as `nama_pegawai`
FROM `lembur`
LEFT JOIN `users` ON `users`.`id` = `lembur`.`id_user`
WHERE `id_user` = '10'
AND MONTH(tanggal) = '06'
AND YEAR(tanggal) = '2026'
ORDER BY `tanggal` DESC