app/Controllers/MasterUnit.php

    public function update_profil_mandiri()
    {
        $session = session();

        // 1. Proteksi awal: Pastikan user sudah login
        if (!$session->get('isLoggedIn')) {
            return redirect()->to(base_url('auth'));
        }

        $db = \Config\Database::connect();
        $idUser = $session->get('id_user');

        // 2. Ambil data dari form modal
        $namaLengkap  = trim($this->request->getPost('nama_lengkap') ?? '');
        $passwordBaru = trim($this->request->getPost('password_baru') ?? '');

        $dataUpdate = [
            'nama_lengkap' => $namaLengkap
        ];

        if (!empty($passwordBaru)) {
            $dataUpdate['password'] = password_hash($passwordBaru, PASSWORD_BCRYPT);
        }

        $db->table('users')
           ->where('id', $idUser)
           ->update($dataUpdate);
---
UPDATE `users` SET `nama_lengkap` = 'Dyan Mardinata Putra, S.Kom', `password` = '$2y$10$Jqdd.6E9/oKnD9xVlj47/eHlt31QGil87yWd9ITstX4MLS3CbLX.C'
WHERE `id` = '1'